cf/Catalogs/ПодарочныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодарочныеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодарочныеКарты_Номинал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодарочныеКарты_Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаПришел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОткудаПришел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументАктивации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ПодарочныеКарты_Номинал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПодарочныеКарты_Номинал</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>н500</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н1000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н3000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н5000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н10000</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ПодарочныеКарты/Ext/ManagerModule.bsl
Функция СформироватьНаименование(Объект) Экспорт
	Возврат Строка(Объект.Номинал) + "-" + Формат(Объект.ПорядковыйНомер,"ЧЦ=6; ЧВН=");
КонецФункции

Функция СуммаПоНоминалу(Номинал) Экспорт
	Если Номинал = Перечисления.ПодарочныеКарты_Номинал.н500 Тогда
		Возврат 500;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н1000 Тогда
		Возврат 1000;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н3000 Тогда
		Возврат 3000;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н5000 Тогда
		Возврат 5000;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н10000 Тогда
		Возврат 10000;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
